# Ultralytics YOLOv8 pruned architecture with only P5 branch

# Parameters
nc: 1  # number of classes (face)
scales:
  n: [0.33, 0.25, 1024]  # depth, width, max_channels

# Backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# Head с удалением P3 и P4
head:
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024]]
  - [[-1], 1, Detect, [nc]]  # Detect(P5)